# შექმენით პროგრამა, რომელიც ბეჭდავს 5-ის ჯერადებს 1-დან 50-ის ჩათვლით for loop-ის გამოყენებით.

# დაწერეთ პროგრამა, რომელიც ბეჭდავს ლუწ რიცხვებს 2-დან 20-ის ჩათვლით for loop-ის გამოყენებით.

# დაწერეთ ალგორითმი, რომელიც დაბეჭდავს 5-იდან ათის ჩათვლით რიცხვების ნამრავლს for loop-ის გამოყენებით.


# დაწერეთ ალგორითმი, რომელიც მომხმარებელს შეეკითხება რიცხვს. თუ რიცხვი ლუწია გაყავით ორზე,
# სხვა შემთხვევაში გაამრავლეთ სამზე და მიუმატეთ ერთი.
# შექმენით ფუნქცია რომელსაც ექნება ერთი პარამეტრი ასაკისთვის და ამ ფუნქციამ უნდა დააბრუნოს მხოლოდ თქვენი ასაკი,
# ფუნქციის გამოძახების დროს ფუნქციას არგუმენტად გადაეცით თქვენი ასაკი
#  შექმენით ოთხი მათემატიკური ფუნქცია, თითოეულს გადაეცით ორი არგუმენტი და სახელის შესაბამისად მოახდინეთ მუშაობა.
# ოპერაციები: +, -, *, /.

# შექმენით ფუნქცია, რომელსაც გადასცემთ მართკუთხედის სიგრძესა და სიმაღლეს, გამოითვლით მის ფართობს.

# შექმენით ფუნქცია, რომელსაც გადასცემთ მართკუთხედის ოთხ გვერდს, გამოითვლით მის პერიმეტრს.

# შექმენით ფუნქცია, რომელიც მიიღებს არგუმენტად სიას და დაბეჭდეთ სიის რიცხვების ჯამი, არ გამოიყენოთ sum.

# შექმენით ფუნქცია, რომელიც დაბეჭდავს კონკრეტული სიიდან მინიმალურ და მაქსიმალურ რიცხვებს, არ გამოიყენოთ min და max.
# გამოიყენეთ def, for, if/else, indexing, print.
# შექმენით ფუნქცია, რომელსაც გადაეცემა მთელი რიცხვების სია.
# თქვენი დავალებაა, რომ ამ სიის ლუწ ინდექსებზე მყოფი რიცხვების ჯამი დააბრუნოთ.
# აუცილებლად გამოიყენეთ return ამ და ასევე შემდეგ დავალებებში.

# შექმენით ფუნქცია, რომელსაც გადაეცემა მთელი რიცხვი. თქვენი დავალებაა,
# რომ დააბრუნოთ ლუწია თუ კენტი ის.
 

