# შექმენით პროგრამა, რომელიც ბეჭდავს 5-ის ჯერადებს 1-დან 50-ის ჩათვლით for loop-ის გამოყენებით.
# for i in range(1,50):
#     if i % 5 == 0:
#         print(i)
    



# დაწერეთ პროგრამა, რომელიც ბეჭდავს ლუწ რიცხვებს 2-დან 20-ის ჩათვლით for loop-ის გამოყენებით.
# for i in range(2,21):
#     if i % 2 == 0:
#         print(i)

# დაწერეთ ალგორითმი, რომელიც დაბეჭდავს 5-იდან ათის ჩათვლით რიცხვების ნამრავლს for loop-ის გამოყენებით.
# count = 1
# for i in range(5,8):
#     count *= i
# print(count)

# დაწერეთ ალგორითმი, რომელიც მომხმარებელს შეეკითხება რიცხვს. თუ რიცხვი ლუწია გაყავით ორზე,
# სხვა შემთხვევაში გაამრავლეთ სამზე და მიუმატეთ ერთი.
# num1=int(input("Enter number: "))
# if num1 % 2 == 0:
#     num1=num1 // 2
# else:
#     num1=num1 * 3 + 1 
# print(num1)
    



# შექმენით ფუნქცია რომელსაც ექნება ერთი პარამეტრი ასაკისთვის და ამ ფუნქციამ უნდა დააბრუნოს მხოლოდ თქვენი ასაკი,
# ფუნქციის გამოძახების დროს ფუნქციას არგუმენტად გადაეცით თქვენი ასაკი
# def age(age):
#     return age
# print(age(16))

#  შექმენით ოთხი მათემატიკური ფუნქცია, თითოეულს გადაეცით ორი არგუმენტი და სახელის შესაბამისად მოახდინეთ მუშაობა.
# ოპერაციები: +, -, *, /.
# def addition(a,b):
#     return a + b
# print(addition(2,5))

# def deduction(a,b):
#     return a - b
# print(deduction(6,3))


# def multiplication(a,b):
#     return a * b
# print(multiplication(3,5))


# def division(a,b):
#     return a // b
# print(division(15,5))

# შექმენით ფუნქცია, რომელსაც გადასცემთ მართკუთხედის სიგრძესა და სიმაღლეს, გამოითვლით მის ფართობს


# შექმენით ფუნქცია, რომელსაც გადასცემთ მართკუთხედის ოთხ გვერდს, გამოითვლით მის პერიმეტრს.

# შექმენით ფუნქცია, რომელიც მიიღებს არგუმენტად სიას და დაბეჭდეთ სიის რიცხვების ჯამი, არ გამოიყენოთ sum.

# შექმენით ფუნქცია, რომელიც დაბეჭდავს კონკრეტული სიიდან მინიმალურ და მაქსიმალურ რიცხვებს, არ გამოიყენოთ min და max.
# გამოიყენეთ def, for, if/else, indexing, print.
# შექმენით ფუნქცია, რომელსაც გადაეცემა მთელი რიცხვების სია.
# თქვენი დავალებაა, რომ ამ სიის ლუწ ინდექსებზე მყოფი რიცხვების ჯამი დააბრუნოთ.
# აუცილებლად გამოიყენეთ return ამ და ასევე შემდეგ დავალებებში.

# შექმენით ფუნქცია, რომელსაც გადაეცემა მთელი რიცხვი. თქვენი დავალებაა,
# რომ დააბრუნოთ ლუწია თუ კენტი ის.
 



