# 1) შექმენით თავდაპირველა ცარიელი სია,
# შემდეგ ამ სიაში დაამაეთ 7 ელემენტი,
# ისევ ამ სიაში მესამე ინდექსზე მდგომ ელემენტს და მეორე ინდექსზე მდგომ ელემენტს შეუცვლით ადგილებს,
# მეოთხე ინდექსზე დაამატებთ ახალ დიდი რიცხვს,
# ასევე მეხუთე ინდექსზე მდგომ ელემენტს და პირველივე ელემენტს ამოშლით სიიდან და დაბეჭდავთ განახლებულ სიას (edited)


# car = []
# car.extend (['porche','lamborgini','Tesla','GTR','bmw', 'mercedes','rolls royce'])

# car[2], car[3] = car[3], car[2] 

# car.insert(4, 100)

# car.pop(5)
# car.pop(0)


# print(car)




