# 2) შექმენით თქვენი ოჯახის წევრების სია,
# რომელშიც მოათავსებთ თქვენი ოჯახის წევრების სახელებს ელემენტებად,
# შემდეგ კი დაბეჭდეთ ერთ გრძელ წინადადებაში დიდი სტრინგი რომელშიც გამოიყენებთ სიის ელემენტებს და შეადგენთ წინადადებას,
# მე ვარ + სიიდან თქვენი სახელი, დედაჩემია + სიიდან დედიკოს სახელი, მამაჩემია + სიიდან მამიკოს სახელი და ასე შემდეგ



family = ["erekle","nana","eleonora","cezari"]

print("chemi saxelia: " + family[0],"dedachemis saxelia: " + family[1], "bebiachemis saxelia: " + family[2],"bauachemis saxelia: " + family[3])





