# 2) შექმენით სია, რომელიც თავდაპირველად იქნება ცარიელი შემდეგ კი ამ სიაში ჩაამატეთ 10 ელემენტი 
#    3) შექმენით ორი სია ერთში თქვენი ხელით ჩაწერეთ ლუწი რიცხვები, მეორეში კენტი რიცხვები შემდეგ კი ეს ორი სია გააერთიანეთ extend ის გამოყენებით 
#    4) შექმენით სია რომელშიც იქნება 20 ელემენტი, შემდეგ კი დაბეჭდეთ თითოეული სათითაოდ for loop ის გამოყენებით
#   5) შექმენით რიცხვებით სავსე სია რომელშიც იქნება 1 დან 20 მდე ყველა რიცხვი,
# შემდეგ კი ამ სიიდან ამოშალეთ ყველა კენტი რიცხვი და დაამატეთ ახალ სიაში,
# ორივე სია დაბეჭდეთ
# 6) შექმენით სია რომელშიც იქნება 10 განსხვავებული რიცხვი შემდეგ კი დაბეჭდეთ ყველა ლისტის ელემენტის ჯამი
# 7) შექმენით რიცხვებით სავსე სია, გამოითვალეთ ამ სიის ელემენტების საშუალო არითმეტიკული (edited)


# 1)

# my_list = []

# my_list.extend([1, 2, 3, 4, 5, 6, 7])

# my_list[2], my_list[3] = my_list[3], my_list[2]

# my_list.insert(4, 100)

# my_list.pop(5)

# my_list.pop(0)

# print(my_list)

# 2)

# ცარიელი სია
# my_list = []

# 10 ელემენტის ჩამატება
# for i in range(1, 11):
#     my_list.append(i)

# print(my_list)

# 3)
# ლუწი რიცხვების სია
# even_numbers = [2, 4, 6, 8, 10]

# კენტი რიცხვების სია
# odd_numbers = [1, 3, 5, 7, 9]

# სიის გაერთიანება
# even_numbers.extend(odd_numbers)

# print(even_numbers)

# 4)
# 20 ელემენტის სია
# twenty_elements = list(range(1, 21))

# თითოეული ელემენტის დაბეჭდვა
# for element in twenty_elements:
#     print(element)

# 5)
# 1-დან 20-მდე ყველა რიცხვი
# numbers = list(range(1, 21))

# ახალი სია კენტი რიცხვებისათვის
# odd_numbers = [num for num in numbers if num % 2 != 0]

# კენტი რიცხვების ამოშლა
# numbers = [num for num in numbers if num % 2 == 0]

# print("კენტი რიცხვები:", odd_numbers)
# print("ლუწი რიცხვები:", numbers)


# 6)

# unique_numbers = [3, 7, 12, 45, 23, 67, 89, 34, 56, 78]

# total_sum = sum(unique_numbers)

# print("ელემენტების ჯამი:", total_sum)

# 7)

# unique_numbers = [3, 7, 12, 45, 23, 67, 89, 34, 56, 78]

# total_sum = sum(unique_numbers)

# print("ელემენტების ჯამი:", total_sum)
