# დაწერე ფუნქცია, რომელიც იღებს x და y პარამეტრებს და აბრუნებს მათ სხვაობას. მაგალითად, გამოიყენე არგუმენტები 10 და 5.
# (გამოიტანა: 5)

# შექმენი ფუნქცია, რომელიც იღებს word1 და word2 პარამეტრებს და აბრუნებს მათ ერთად შერწყმულს.
# მაგალითად, გამოიყენე არგუმენტები "გამარჯობა" და "მეგობარო".
# (გამოიტანა: "გამარჯობა მეგობარო")

# დაწერე ფუნქცია, რომელიც იღებს length და width პარამეტრებს და ითვლის მართკუთხედის ფართობს.
# მაგალითად, გამოიყენე არგუმენტები 4 და 6. (გამოიტანა: 24)

# შექმენი ფუნქცია, რომელიც იღებს name პარამეტრს და აბრუნებს "გამარჯობა, [name]" შეტყობინებას. მაგალითად,
# გამოიყენე არგუმენტი "ანა". (გამოიტანა: "გამარჯობა, ანა")
# შექმნი ფუნქცია, რომელიც იღებს number პარამეტრს და აბრუნებს "დიდია" თუ number 10-ზე მეტია და "პატარა" თუ ნაკლებია.
# მაგალითად, გამოიყენე არგუმენტი 9.
# (გამოიტანა: "პატარა")

# დაწერე ფუნქცია, რომელიც აბრუნებს შეტყობინებას "კარგი დღე გქონდეს!". პარამეტრები არ არის საჭირო.

# შექმნი ფუნქცია, რომელიც იღებს a და b პარამეტრებს და აბრუნებს მათ ჯამს. მაგალითად, გამოიყენე არგუმენტები 7 და 3. (გამოიტანა: 10)

# დაწერე ფუნქცია, რომელიც იღებს number პარამეტრს და აბრუნებს number-ის კუბს. მაგალითად, გამოიყენე არგუმენტი 3. (გამოიტანა: 27)

# შექმენი ფუნქცია, რომელიც აბრუნებს შეტყობინებას "საუკეთესო ხარ!". პარამეტრები არ არის საჭირო.
# დაწერე ფუნქცია, რომელიც იღებს number პარამეტრს და აბრუნებს "კენტი" ან "ლუწი".
#  მაგალითად, გამოიყენე არგუმენტი 8. (გამოიტანა: "ლუწი")








